from string import Template

### RAG Prompts ###


### System ####
system_prompt = Template("\n".join([
    "أنت مساعد مكلّف بإنشاء إجابة للمستخدم.",
    "سيتم تزويدك بمجموعة من المستندات المرتبطة باستعلام المستخدم.",
    "يجب عليك إنشاء الإجابة بناءً على المستندات المقدّمة.",
    "تجاهل المستندات غير المرتبطة باستعلام المستخدم.",
    "يمكنك الاعتذار للمستخدم إذا لم تتمكن من إنشاء إجابة.",
    "يجب أن تكون الإجابة بنفس لغة استعلام المستخدم.",
    "كن مهذبًا ومحترمًا مع المستخدم.",
    "كن دقيقًا ومختصرًا في إجابتك وتجنب المعلومات غير الضرورية.",
]))



### Document ###
document_prompt = Template(
    "\n".join([
        "## رقم المستند: $doc_num",
        "### المحتوى: $chunk_text"
    ])
)


### Footer ###
footer_prompt = Template(
    "\n".join([
        "بناءًفقط على المستندات أعلاه، يرجى إنشاء إجابة للمستخدم.",
        "## السؤال: ",
        "$query",
        ""
        "## الإجابة:",
    ])
)